/*
*┌────────────────────────────────────────────────┐
*│　描    述：扩展会员服务模块   
*│  部    门：质量架构部
*│　作    者：华威                                              
*│　版    本：1.0                                              
*│　创建时间：2020.05.27                        
*└────────────────────────────────────────────────┘
*/

/////////////////////////////////////////////////////////////////////////////////////////////////////
//                                              _ooOoo_                                            //
//                                             o8888888o                                           //
//                                             88" . "88                                           //
//                                             (| ^_^ |)                                           //
//                                             O\  =  /O                                           //
//                                          ____/`---'\____                                        //
//                                        .'  \\|     |//  `.                                      //
//                                       /  \\|||  :  |||//  \                                     //
//                                      /  _||||| -:- |||||-  \                                    //
//                                      |   | \\\  -  /// |   |                                    //
//                                      | \_|  ''\---/''  |   |                                    //
//                                      \  .-\__  `-`  ___/-. /                                    //
//                                    ___`. .'  /--.--\  `. . ___                                  //
//                                  ."" '<  `.___\_<|>_/___.'  >'"".                               //
//                                | | :  `- \`.;`\ _ /`;.`/ - ` : | |                              //
//                                \  \ `-.   \_ __\ /__ _/   .-` /  /                              //
//                          ========`-.____`-.___\_____/___.-`____.-'========                      //
//                                               `=---='                                           //
//                          ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^                     //
//                               佛祖保佑       永不宕机     永无BUG                               //
/////////////////////////////////////////////////////////////////////////////////////////////////////
///
using Abp.Application.Services;
using Faker.Solution.Authorization.Users;
using Faker.Solution.MultiTenancy;
using System;
using System.Collections.Generic;
using System.Text;

namespace Service.Demo.Application
{
    public class DemoAppServiceBase: ApplicationService
    {
        public TenantManager TenantManager { get; set; }

        public UserManager UserManager { get; set; }
    }
}
