/*
*┌────────────────────────────────────────────────┐
*│　描    述：异常捕获类（所有引发的异常都会被拦截，调试或者处理时候修改此对象）   
*│  部    门：质量架构部
*│　作    者：华威                                              
*│　版    本：1.0                                              
*│　创建时间：2020.05.27                        
*└────────────────────────────────────────────────┘
*/

/////////////////////////////////////////////////////////////////////////////////////////////////////
//                                              _ooOoo_                                            //
//                                             o8888888o                                           //
//                                             88" . "88                                           //
//                                             (| ^_^ |)                                           //
//                                             O\  =  /O                                           //
//                                          ____/`---'\____                                        //
//                                        .'  \\|     |//  `.                                      //
//                                       /  \\|||  :  |||//  \                                     //
//                                      /  _||||| -:- |||||-  \                                    //
//                                      |   | \\\  -  /// |   |                                    //
//                                      | \_|  ''\---/''  |   |                                    //
//                                      \  .-\__  `-`  ___/-. /                                    //
//                                    ___`. .'  /--.--\  `. . ___                                  //
//                                  ."" '<  `.___\_<|>_/___.'  >'"".                               //
//                                | | :  `- \`.;`\ _ /`;.`/ - ` : | |                              //
//                                \  \ `-.   \_ __\ /__ _/   .-` /  /                              //
//                          ========`-.____`-.___\_____/___.-`____.-'========                      //
//                                               `=---='                                           //
//                          ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^                     //
//                               佛祖保佑       永不宕机     永无BUG                               //
/////////////////////////////////////////////////////////////////////////////////////////////////////
using Abp.Dependency;
using Abp.Events.Bus.Exceptions;
using Abp.Events.Bus.Handlers;
using System;
using System.Collections.Generic;
using System.Text;

namespace Faker.Solution
{
    public class ExceptionHandler: IEventHandler<AbpHandledExceptionData>, ITransientDependency
    {
        public void HandleEvent(AbpHandledExceptionData eventData)
        {
            //TODO: 检查 eventData.Exception!
        }
    }
}
